# TABELAS

In [1]:
import pandas as pd

data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana'],
    'Idade': [28, 34, 45, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']
}

df = pd.DataFrame(data)

df

     Nome  Idade          Cidade
0     Ana     28       São Paulo
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3   Diana     22        Curitiba

# REPETIÇÃO ⬇

In [8]:
import pandas as pd
import numpy as np

num_rows = 10
num_cols = 5

data2 = {
    'ID': np.arange(1, num_rows + 1),
    'Nome': [f'Nome_{i}' for i in range(1, num_rows +1)],
    'Idade': np.random.randint(18, 70, size=num_rows),
    'Salario': np.random.uniform(2000, 10000, size = num_rows).round(2),
    'Cidade': np.random.choice(['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba', 'Porto Alegre'], size = num_rows)
}

df2 = pd.DataFrame(data2)

df2

   ID     Nome  Idade  Salario          Cidade
0   1   Nome_1     39  2644.18  Rio de Janeiro
1   2   Nome_2     21  4418.72       São Paulo
2   3   Nome_3     66  5255.79       São Paulo
3   4   Nome_4     47  4173.05        Curitiba
4   5   Nome_5     45  5220.28        Curitiba
5   6   Nome_6     52  6043.36  Belo Horizonte
6   7   Nome_7     60  6227.56       São Paulo
7   8   Nome_8     21  3007.01  Rio de Janeiro
8   9   Nome_9     29  9898.18  Rio de Janeiro
9  10  Nome_10     67  6975.08        Curitiba